
    // Do not modify this file by hand!
    // Re-generate this file by running lit-localize

    
    import {str} from '@lit/localize';

    /* eslint-disable no-irregular-whitespace */
    /* eslint-disable @typescript-eslint/no-explicit-any */

    export const templates = {
      's091d5d07b5b33dcf': `Ок`,
's11a77291cef65fa2': `Подключиться к `,
's16564e19b102f152': `Box`,
's1f4066f335d7b2b5': `OneDrive`,
's20acbc36b5c226e9': `Загружено {count} из {totalCount} файлов`,
's246fc982138d9ce5': `Dropbox`,
's288b1c7b6cd3fa96': str`Импорт из ${0}`,
's2ceb11be2290bb1b': `Отмена`,
's383261a00822ec87': `Яндекс.Диск`,
's466a639c23c841b1': `К сожалению, возникла проблема. Повторите попытку позже`,
's5e4c861bb08b34bd': `Перетащите файлы, вставьте, выберите файлы или импортируйте из:`,
's6c64ea0431f97bb2': `Внесенные изменения не сохранятся`,
's6e6e4d288ea76fc4': `Есть несохранённые изменения`,
's82cdbed6651a6597': str`Выбрано файлов: ${0}`,
's86cc0195462041ed': str`Пожалуйста, авторизуйтесь в ${0}, затем выберите файлы`,
's96668830629e0dfc': `Загрузить`,
's9da52d7bde996494': `Пожалуйста, авторизуйтесь в {provider}, затем выберите файлы`,
'sad7b3ee1c22c6f56': `Google Drive`,
'sb64127e4e4f0b575': `Выйти`,
'sb79b1d5b804c7b47': `Моё устройство`,
'sb9bd4f5a3810b77e': `Что-то пошло не так`,
'sc16e00a7a8b2fde2': `Назад`,
'scbd2e236eed79c0d': `Загрузить как ссылки`,
'sd86377f9c3cd9256': `Загрузка: `,
'se21de8412bcfa692': `Выберите этот параметр, чтобы загружать файлы в виде ссылок. Это позволяет экономить место на диске, так как сами файлы не будут храниться локально.`,
'sed12af3ae308489e': `Перетащите файлы сюда, выберите файлы или импортируйте из:`,
'sf5eaa1a29802dfaf': `Перетащите файлы сюда`,
'sf8c14c7b76940e65': `Добавить ещё`,
'sfc63e31ac7c956ed': `Выбрать`,
    };
  