Repository: AndrewBavyka/awc-file-upload
Catalog: xliff/*.xlf
Languages: ru_ru

# sb79b1d5b804c7b47
source: My device
ru_ru: Моё устройство

# s383261a00822ec87
source: Yandex.Disk
ru_ru: Яндекс.Диск

# s96668830629e0dfc
source: Upload
ru_ru: Загрузить

# s2ceb11be2290bb1b
source: Cancel
ru_ru: Отмена

# sf8c14c7b76940e65
source: Add more
ru_ru: Добавить ещё

# sfc63e31ac7c956ed
source: Select
ru_ru: Выбрать

# sb64127e4e4f0b575
source: Log out
ru_ru: Выйти

# sc16e00a7a8b2fde2
source: Back
ru_ru: Назад

# scbd2e236eed79c0d
source: Upload as links
ru_ru: Загрузить как ссылки

# se21de8412bcfa692
source: Choose this option to upload files as links. This saves disk space as files will not be stored locally.
ru_ru: Выберите этот параметр, чтобы загружать файлы в виде ссылок. Это позволяет экономить место на диске, так как сами файлы не будут храниться локально.

# sd86377f9c3cd9256
source: Uploading:
ru_ru: Загрузка:

# s20acbc36b5c226e9
source: Uploaded {count} of {totalCount} files
ru_ru: Загружено {count} из {totalCount} файлов

# sb9bd4f5a3810b77e
source: Something went wrong
ru_ru: Что-то пошло не так

# s466a639c23c841b1
source: Unfortunately, there was a problem. Please try again later
ru_ru: К сожалению, возникла проблема. Повторите попытку позже

# s9da52d7bde996494
source: Please authorize in {provider}, then select files
ru_ru: Пожалуйста, авторизуйтесь в {provider}, затем выберите файлы

# s11a77291cef65fa2
source: Connect to
ru_ru: Подключиться к

# sf5eaa1a29802dfaf
source: Drop files here
ru_ru: Перетащите файлы сюда

# s6e6e4d288ea76fc4
source: Unsaved changes
ru_ru: Есть несохранённые изменения

# s6c64ea0431f97bb2
source: Your changes will not be saved
ru_ru: Внесенные изменения не сохранятся

# s091d5d07b5b33dcf
source: Ok
ru_ru: Ок

# s5e4c861bb08b34bd
source: Drop files, paste, select files or import from:
ru_ru: Перетащите файлы, вставьте, выберите файлы или импортируйте из:

# sed12af3ae308489e
source: Drop files here, browse files, or import from:
ru_ru: Перетащите файлы сюда, выберите файлы или импортируйте из:

# s288b1c7b6cd3fa96
source: Import from ${this.textState.selectedProvider}
ru_ru: Импорт из ${this.textState.selectedProvider}

# s82cdbed6651a6597
source: ${this.textState.selectedFilesCount} files selected
ru_ru: Выбрано файлов: ${this.textState.selectedFilesCount}

# s86cc0195462041ed
source: Please authorize in ${providerName}, then select files
ru_ru: Пожалуйста, авторизуйтесь в ${providerName}, затем выберите файлы

# s5e70904afec9e177
source: Unable to upload to storage - file is going to be ${this.maxFileSize}
ru_ru: Невозможно загрузить в хранилище - файл превышает ${this.maxFileSize}

# sc6f29a006d9d4942
source: You can upload up to ${this.maxFilesCount} files at once
ru_ru: Можно загрузить до ${this.maxFilesCount} файлов одновременно

# sc51965a87fac0145
source: Uploaded ${this._uploadedCount} of ${getAllSelectedFiles().length} files
ru_ru: Загружено ${this._uploadedCount} из ${getAllSelectedFiles().length} файлов

# s66f42f6482701b7e
source: Up to ${this.maxFilesCount} files, ${formatFileSize(this.maxFileSize, true)}
ru_ru: До ${this.maxFilesCount} файлов, ${formatFileSize(this.maxFileSize, true)}
